

#include <iostream>

int main()
{
    setlocale(LC_ALL, "Rus");

    /* 2.32
    double x, z, y,d,x1,y1,z1;
    std::cout << "Введите стоимость 1 кг конфет, яблок и печенья "; 
    std::cin >> x1 >> y1 >> z1;
    std::cout << "Введите количество товара которое хотите купить в кг ";
    std::cin >> x >> y >> z;
    d = (x * x1) + (y * y1) + (z * z1);
    std::cout << "Стоимость всей покупки " << d;
    */

    /* 2.32
    double m, s, k, c,n;
    std::cout << "Введите стоимость монитора, системного блока, клавиатуры и мыши в рублях ";
    std::cin >> m >> s >> k >> c;
    std::cout << "Введите количество компьютеров которые хотите купить ";
    std::cin >> n;
    double komp = (m + s + k + c) *3;
    double komp1 = (m + s + k + c) * n;
    std::cout << "Стоимость 3 компьютеров " << komp <<"\n";
    std::cout << "Стоимость n компьютеров " << komp1;
    */

    /* 2.34
    double t, m,s,s1,s2;
    std::cout << "Введите возраст Тани и Мити ";
    std::cin >> t >> m;
    s = (t + m) / 2;
    s1 = std::abs(t - s);
    s2 = std::abs(m - s);
    std::cout << "Возраст Тани отличается на " << s1 << std::endl;
    std::cout << "Возраст Мити отличается на " << s2;
    */
    
    /* 2.34
    double v1, v2, s,v3,s1;
    std::cout << "Введите расстояние между городами и скорость 1 и 2 автомобилей ";
    std::cin >> s >> v1 >> v2;
    v3 = v1 + v2;
    s1 = s / v3;
    std::cout << "Время через которое авто встретяться " << s1;
    */
}

